package nlj.business.carrier.service;

import com.next.logistic.util.BaseUtil;
import java.security.SecureRandom;
import java.util.HashMap;
import java.util.Map;
import org.springframework.stereotype.Component;

/**
 * <PRE>
 * ギャイシャー値コンポーネント。
 * </PRE>
 *
 * @author Next Logistics Japan
 */
@Component
public class GiaiValueComponent {

    private final Map<String, String> hashMap;

    public GiaiValueComponent() {
        this.hashMap = new HashMap<>();
        // NLJ
        hashMap.put("豊田100か1122", "8004991000001000000000000000000001");
        hashMap.put("つくば100か235", "8004991000001000000000000000000002");
        hashMap.put("静岡100か123", "8004991000001000000000000000000003");
        hashMap.put("相模100か5566", "8004991000001000000000000000000004");
        hashMap.put("豊田100え1008", "8004991000001000000000000000000005");
        hashMap.put("豊田100え2109", "8004991000001000000000000000000006");
        hashMap.put("豊田100え2219", "8004991000001000000000000000000007");
        hashMap.put("豊田100え1011", "8004991000001000000000000000000008");
        hashMap.put("静岡100え3001", "8004991000001000000000000000000009");
        hashMap.put("静岡100え3223", "8004991000001000000000000000000010");
        hashMap.put("つくば100え535", "8004991000001000000000000000000011");
        hashMap.put("つくば100え3003", "8004991000001000000000000000000012");
        hashMap.put("豊田100え189", "8004991000001000000000000000000013");
        hashMap.put("郡山100え2214", "8004991000001000000000000000000014");
        hashMap.put("豊田100え1345", "8004991000001000000000000000000015");
        hashMap.put("豊田100え1245", "8004991000001000000000000000000016");
        hashMap.put("つくば100え2678", "8004991000001000000000000000000017");
        hashMap.put("豊田100え1278", "8004991000001000000000000000000018");
        hashMap.put("豊田100え2378", "8004991000001000000000000000000019");
        hashMap.put("豊田100え2233", "8004991000001000000000000000000020");
        hashMap.put("静岡100え3200", "8004991000001000000000000000000021");
        hashMap.put("豊田100え54", "8004991000001000000000000000000022");
        hashMap.put("豊田100え1111", "8004991000001000000000000000000023");
        hashMap.put("相模100え1267", "8004991000001000000000000000000024");
        hashMap.put("豊田100え1003", "8004991000001000000000000000000025");
        hashMap.put("豊田100え1221", "8004991000001000000000000000000026");
        hashMap.put("豊田100え55", "8004991000001000000000000000000027");
        hashMap.put("豊田100え66", "8004991000001000000000000000000028");
        hashMap.put("静岡100え2020", "8004991000001000000000000000000029");
        hashMap.put("静岡100え2025", "8004991000001000000000000000000030");
        hashMap.put("群馬100え2723", "8004991000001000000000000000000031");
        hashMap.put("京都100え2244", "8004991000001000000000000000000032");
        hashMap.put("神戸100え8080", "8004991000001000000000000000000033");
        hashMap.put("神戸100え7073", "8004991000001000000000000000000034");
        hashMap.put("豊田100か1813", "8004991000001000000000000000000035");
        hashMap.put("豊田100か5533", "8004991000001000000000000000000036");
        hashMap.put("豊田100か5531", "8004991000001000000000000000000037");
        hashMap.put("豊田100か5520", "8004991000001000000000000000000038");
        hashMap.put("郡山100か2002", "8004991000001000000000000000000039");
        hashMap.put("静岡100き765", "8004991000001000000000000000000040");
        hashMap.put("つくば100か7654", "8004991000001000000000000000000041");
        hashMap.put("豊田100か4321", "8004991000001000000000000000000042");
        hashMap.put("豊田100か4455", "8004991000001000000000000000000043");
        hashMap.put("相模100き1001", "8004991000001000000000000000000044");
        hashMap.put("豊田100か2021", "8004991000001000000000000000000045");
        hashMap.put("豊田100か2024", "8004991000001000000000000000000046");
        hashMap.put("つくば100は4187", "8004991000001000000000000000000050");

        // Yamato
        hashMap.put("大宮100き1001", "8004991000002000000000000000000001");
        hashMap.put("相模100き1002", "8004991000002000000000000000000002");
        hashMap.put("相模100か1003", "8004991000002000000000000000000003");
        hashMap.put("相模100き1004", "8004991000002000000000000000000004");
        hashMap.put("相模100き1005", "8004991000002000000000000000000005");
        hashMap.put("相模100か1006", "8004991000002000000000000000000006");
        hashMap.put("相模100き1007", "8004991000002000000000000000000007");
        hashMap.put("大宮100き1008", "8004991000002000000000000000000008");
        hashMap.put("相模100き1009", "8004991000002000000000000000000009");
        hashMap.put("相模100か1010", "8004991000002000000000000000000010");
        hashMap.put("相模100き1011", "8004991000002000000000000000000011");
        hashMap.put("相模100え2001", "8004991000002000000000000000000012");
        hashMap.put("相模100え2002", "8004991000002000000000000000000013");
        hashMap.put("相模100え2003", "8004991000002000000000000000000014");
        hashMap.put("相模100え2004", "8004991000002000000000000000000015");
        hashMap.put("相模100え2005", "8004991000002000000000000000000016");
        hashMap.put("相模100え2006", "8004991000002000000000000000000017");
        hashMap.put("相模100え2007", "8004991000002000000000000000000018");
        hashMap.put("相模100え2008", "8004991000002000000000000000000019");
        hashMap.put("相模100え2009", "8004991000002000000000000000000020");
        hashMap.put("相模100え2010", "8004991000002000000000000000000021");
        hashMap.put("相模100え2011", "8004991000002000000000000000000022");
    }

    public String getGiai(String areaCode, String groupNumber, String character, String number1) {

        String giaiSeries = null;
        if (!BaseUtil.isNull(areaCode) && !BaseUtil.isNull(groupNumber)
            && !BaseUtil.isNull(character) && !BaseUtil.isNull(number1)) {

            String placeCode = areaCode.trim() + groupNumber.trim() + character.trim() + number1.trim();
            giaiSeries = hashMap.get(placeCode);
        }

        if (giaiSeries == null) {
            // generate random numbers
            giaiSeries = "8009";
            SecureRandom random = new SecureRandom();
            StringBuilder middlePart = new StringBuilder();

            for (int i = 0; i < 30; i++) {
                middlePart.append(random.nextInt(10));
            }

            giaiSeries = giaiSeries + middlePart;
        }
        return giaiSeries;
    }
}
